In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
%matplotlib inline

In [2]:
apr = pd.read_csv("uber-raw-data-apr14.csv")

In [3]:
apr.head()

          Date/Time      Lat      Lon    Base
0  04-01-2014 00:11  40.7690 -73.9549  B02512
1  04-01-2014 00:17  40.7267 -74.0345  B02512
2  04-01-2014 00:21  40.7316 -73.9873  B02512
3  04-01-2014 00:28  40.7588 -73.9776  B02512
4  04-01-2014 00:33  40.7594 -73.9722  B02512

In [4]:
aug = pd.read_csv("uber-raw-data-aug14.csv")

In [5]:
aug.head()

          Date/Time      Lat      Lon    Base
0  8/1/2014 0:03:00  40.7366 -73.9906  B02512
1  8/1/2014 0:09:00  40.7260 -73.9918  B02512
2  8/1/2014 0:12:00  40.7209 -74.0507  B02512
3  8/1/2014 0:12:00  40.7387 -73.9856  B02512
4  8/1/2014 0:12:00  40.7323 -74.0077  B02512

In [6]:
jul = pd.read_csv("uber-raw-data-jul14.csv")

In [7]:
jul.head()

          Date/Time      Lat      Lon    Base
0  7/1/2014 0:03:00  40.7586 -73.9706  B02512
1  7/1/2014 0:05:00  40.7605 -73.9994  B02512
2  7/1/2014 0:06:00  40.7320 -73.9999  B02512
3  7/1/2014 0:09:00  40.7635 -73.9793  B02512
4  7/1/2014 0:20:00  40.7204 -74.0047  B02512

In [8]:
jun = pd.read_csv("uber-raw-data-jun14.csv")

In [9]:
jun.head()

          Date/Time      Lat      Lon    Base
0  6/1/2014 0:00:00  40.7293 -73.9920  B02512
1  6/1/2014 0:01:00  40.7131 -74.0097  B02512
2  6/1/2014 0:04:00  40.3461 -74.6610  B02512
3  6/1/2014 0:04:00  40.7555 -73.9833  B02512
4  6/1/2014 0:07:00  40.6880 -74.1831  B02512

In [10]:
may = pd.read_csv("uber-raw-data-may14.csv")

In [11]:
may.head()

          Date/Time      Lat      Lon    Base
0  5/1/2014 0:02:00  40.7521 -73.9914  B02512
1  5/1/2014 0:06:00  40.6965 -73.9715  B02512
2  5/1/2014 0:15:00  40.7464 -73.9838  B02512
3  5/1/2014 0:17:00  40.7463 -74.0011  B02512
4  5/1/2014 0:17:00  40.7594 -73.9734  B02512

In [12]:
sep = pd.read_csv("uber-raw-data-sep14.csv")

In [13]:
sep.head()

          Date/Time      Lat      Lon    Base
0  9/1/2014 0:01:00  40.2201 -74.0021  B02512
1  9/1/2014 0:01:00  40.7500 -74.0027  B02512
2  9/1/2014 0:03:00  40.7559 -73.9864  B02512
3  9/1/2014 0:06:00  40.7450 -73.9889  B02512
4  9/1/2014 0:11:00  40.8145 -73.9444  B02512

In [14]:
df = apr.append(aug)

In [15]:
df.head()

          Date/Time      Lat      Lon    Base
0  04-01-2014 00:11  40.7690 -73.9549  B02512
1  04-01-2014 00:17  40.7267 -74.0345  B02512
2  04-01-2014 00:21  40.7316 -73.9873  B02512
3  04-01-2014 00:28  40.7588 -73.9776  B02512
4  04-01-2014 00:33  40.7594 -73.9722  B02512

In [16]:
df.tail()

                 Date/Time      Lat      Lon    Base
829270  8/31/2014 23:55:00  40.7552 -73.9753  B02764
829271  8/31/2014 23:55:00  40.7552 -73.9753  B02764
829272  8/31/2014 23:55:00  40.7617 -73.9788  B02764
829273  8/31/2014 23:59:00  40.7395 -73.9889  B02764
829274  8/31/2014 23:59:00  40.7270 -73.9802  B02764

In [17]:
df1 = df.append(jun)

In [19]:
df1.tail()

                 Date/Time      Lat      Lon    Base
663839  6/30/2014 22:40:00  40.7332 -73.9872  B02764
663840  6/30/2014 23:12:00  40.7905 -73.9796  B02764
663841  6/30/2014 23:13:00  40.7640 -73.9887  B02764
663842  6/30/2014 23:15:00  40.7262 -73.9944  B02764
663843  6/30/2014 23:35:00  40.7404 -73.9848  B02764

In [20]:
df2 = df1.append(jul)

In [21]:
df2.tail()

                 Date/Time      Lat      Lon    Base
796116  7/31/2014 23:22:00  40.7285 -73.9846  B02764
796117  7/31/2014 23:23:00  40.7615 -73.9868  B02764
796118  7/31/2014 23:29:00  40.6770 -73.9515  B02764
796119  7/31/2014 23:30:00  40.7225 -74.0038  B02764
796120  7/31/2014 23:58:00  40.7199 -73.9884  B02764

In [22]:
df3 = df2.append(may)

In [23]:
df3.tail()

                 Date/Time      Lat      Lon    Base
652430  5/31/2014 23:45:00  40.7309 -74.0014  B02764
652431  5/31/2014 23:52:00  40.7528 -73.9798  B02764
652432  5/31/2014 23:55:00  40.7158 -73.9519  B02764
652433  5/31/2014 23:56:00  40.6961 -73.8997  B02764
652434  5/31/2014 23:59:00  40.7393 -73.9919  B02764

In [24]:
data = df3.append(sep)

In [25]:
data.tail()

                  Date/Time      Lat      Lon    Base
1028131  9/30/2014 22:57:00  40.7668 -73.9845  B02764
1028132  9/30/2014 22:57:00  40.6911 -74.1773  B02764
1028133  9/30/2014 22:58:00  40.8519 -73.9319  B02764
1028134  9/30/2014 22:58:00  40.7081 -74.0066  B02764
1028135  9/30/2014 22:58:00  40.7140 -73.9496  B02764

In [26]:
def count_rows(rows):
    return len(rows)

by_basecode = data.groupby('Base').apply(count_rows)
by_basecode

Base
B02512     205673
B02598    1393113
B02617    1458853
B02682    1212789
B02764     263899
dtype: int64

In [29]:
data.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 4534327 entries, 0 to 1028135
Data columns (total 4 columns):
 #   Column     Dtype
---  ------     -----
 0   Date/Time  object
 1   Lat        float64
 2   Lon        float64
 3   Base       object
dtypes: float64(2), object(2)
memory usage: 173.0+ MB

In [30]:
data.describe

<bound method NDFrame.describe of                   Date/Time      Lat      Lon    Base
0          04-01-2014 00:11  40.7690 -73.9549  B02512
1          04-01-2014 00:17  40.7267 -74.0345  B02512
2          04-01-2014 00:21  40.7316 -73.9873  B02512
3          04-01-2014 00:28  40.7588 -73.9776  B02512
4          04-01-2014 00:33  40.7594 -73.9722  B02512
...                     ...      ...      ...     ...
1028131  9/30/2014 22:57:00  40.7668 -73.9845  B02764
1028132  9/30/2014 22:57:00  40.6911 -74.1773  B02764
1028133  9/30/2014 22:58:00  40.8519 -73.9319  B02764
1028134  9/30/2014 22:58:00  40.7081 -74.0066  B02764
1028135  9/30/2014 22:58:00  40.7140 -73.9496  B02764

[4534327 rows x 4 columns]>

In [34]:
data.describe()

                Lat           Lon
count  4.534327e+06  4.534327e+06
mean   4.073926e+01 -7.397302e+01
std    3.994991e-02  5.726670e-02
min    3.965690e+01 -7.492900e+01
25%    4.072110e+01 -7.399650e+01
50%    4.074220e+01 -7.398340e+01
75%    4.076100e+01 -7.396530e+01
max    4.211660e+01 -7.206660e+01

In [36]:
data.shape

(4534327, 4)

In [37]:
data.isnull().any()

Date/Time    False
Lat          False
Lon          False
Base         False
dtype: bool